Group1_Documentation.tex
% Created 2022-05-23 Mo 16:12
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[a4paper, margin=1in]{geometry}
\author{Group 1: Gabriel, Odermatt, Wey \& Yang}
\date{\today}
\title{OS Project - Fribourgeois Bakery}
\hypersetup{
 pdfauthor={Group 1: Gabriel, Odermatt, Wey \& Yang},
 pdftitle={OS Project - Fribourgeois Bakery},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\setlength\parindent{0pt}

\section{Introduction}
\label{sec:orgd5ac86a}

The present documentation reports on the solution to the \emph{Fribourgeois Bakery} project elaborated by Group 1.\\

The discussion of the solution will be structured as follows: Chapter one will present the datastructure that represents our inventory as well as our solution to the task ``Learning to make bread''. Chapter two will focus on ``Too good to go'' and chapter four will present our additional feature. Our implementation decisions as well as the scenarios will be discussed in chapter one.\\

\section{Inventory and Making Bread}
\label{sec:orgb8b50e4}

\subsection{Inventory}
\label{sec:org7e54d28}
\begin{itemize}
\item Binary tree where each node represents an ingredient type. Each of those nodes holds a linked list where each node represents one unit of that ingredient type.\\
\item Building and searching of tree: Tree is lexographically sorted -- meaning that that the left child of each parent node contains an ingredient type whose name is smaller and the right child contains an ingredient type whose name is bigger than the parents name. ``Smaller'' and ``bigger'' in this context refer to the ordering of characters proposed by the ASCII standard. Due to this strict ordering of ingredients, the tree can be traversed and searched very efficiently\(\footnote{Strictly speaking this does not always have to be the case. If the ingredients happen to be added in ASCII order (or in reverse) then the tree would be a normal linked list and searching the tree would perform accordingly.}\).\\
\item Traversal of the tree:\\
\begin{itemize}
\item Iterativ oder rekursiv, richtig? (@Lukas). In getInvNode() ist es iterativ, in restock() ist es rekursiv.\\
\end{itemize}
\item Useful functions provided:\\
\begin{itemize}
\item registerIngredient()\\
\item addIngredient()\\
\item takeIngredient()\\
\item restock()\\
\end{itemize}
\item Data structure size: Binary tree can grow in two dimensions: Regarding ingredient types and regarding ingredient units.\\
\item Simultaneous access:\\
\begin{itemize}
\item We chose to implement concurrency client-side, i.e. not in the datastructure itself but in the ``Making bread'' script.\\
\item We could have implemented mutual exclusion in the datastructure itself either on the entire datastructure or only on the linked list inside the ingredient node. However,\\
\end{itemize}
\end{itemize}

\subsection{Making Bread}
\label{sec:orgac53115}

\begin{itemize}
\item Synchronization:\\
\begin{itemize}
\item Mutex: The inventory is mutexed.\\
\item Semaphore: Coordination between baker, apprentices and shopper.\\
\end{itemize}
\item Scheduler Strategy:\\
\begin{itemize}
\item When an apprentice wants to access the inventory they announce their interest in a global array by modifying the field at the index that corresponds to their id. Depending on the schedular metric used, they insert differnt values. Access to this array may be concurrent since every index can only be written by one apprentice.\\
\item Implemented four schedulers: (i) Predefined learners (ii) Arrival Order (based on time) (iii) Fast learners (apprentice with the most baked breads) (iv) Fairlearners (apprentice with the least baked breads).\\
\item Explain when each of the strategies performs best and worst.\\
\end{itemize}
\end{itemize}

\subsection{Scenarios}
\label{sec:orgb90574b}
\begin{itemize}
\item Scenarios:\\
\begin{itemize}
\item (i) Apprentices add the same item to the inventory: In func registerIngredient() we first check whether the ingredient has already been registered. If so, we restock to initial amount but do not add it again.\\
\item (ii) Apprentices access the same item in the inventory: Not possible by design, since the datastructure is made mutually exclusive and since we synchronize the apprentices using the baker as the schedular.\\
\item (iii) Same as (ii) except in this case we synchronize between apprentice and shopper. But the approach stays the same.\\
\end{itemize}
\end{itemize}

\section{Too Good To Go}
\label{sec:org626b7a7}
\begin{itemize}
\item Analogy to NRU\\
\end{itemize}

\section{Additional Feature}
\label{sec:org8151c41}
\begin{itemize}
\item Chairs: Queue, mutexted.\\
\item Synchronization: Semaphores (one for the baker and one for each chair).\\
\end{itemize}
\end{document}
